{
    "home": "Início",
    "hi": "Olá",
    "my-name-is": "Meu nome é",
    "i-build-things": "Eu construo coisas com código",
    "about": "Sobre mim",
    "about-me-resume": "Formado em Análise e Desenvolvimento de Sistemas, atuo como desenvolvedor fullstack, aplicando meu conhecimento técnico para entregar soluções de software que aliam eficiência e qualidade. Tenho experiência prática no desenvolvimento back-end com Python e Flask, além de NodeJS, utilizando JavaScript e TypeScript. No front-end, trabalho com React, criando interfaces de usuário modernas e funcionais. Em ambientes de cloud, utilizo serviços da AWS como Lambda, DynamoDB, RDS, SES e EKS para construir aplicações escaláveis e seguras. Também possuo vivência em Infraestrutura como Código (IaC) com Terraform, o que me permite automatizar e gerenciar a infraestrutura de forma eficaz. Minha familiaridade com metodologias ágeis, como Scrum, facilita a colaboração e a entrega contínua em projetos complexos. Além disso, tenho experiência com a cultura DevOps, utilizando diariamente ferramentas e processos que agilizam o ciclo de entrega de software, como Git, Docker, CI/CD com Gitlab CI, GitOps, Kubernetes e ArgoCD. Isso me proporciona uma visão abrangente de todo o ciclo de vida do software, desde o desenvolvimento até a produção. Em projetos acadêmicos e pessoais, desenvolvi com Java e Spring Framework, e explorei o uso de Angular para criar aplicações front-end. Também utilizei GitHub Actions para automatizar fluxos de trabalho, reforçando minhas habilidades em integração e entrega contínua. Atualmente, estou envolvido no desenvolvimento de uma plataforma que visa aprimorar a experiência de desenvolvimento dentro da empresa, utilizando como base o software open source Backstage da Spotify. O projeto abrange desde a criação de microsserviços até a configuração de infraestrutura em cloud, incluindo a entrega automatizada de serviços da AWS via IaC com Terraform, tudo com o objetivo de acelerar o ciclo de entrega e melhorar a experiência dos desenvolvedores.",
    "work-experience": "Experiência",
    "software-enginner": "Engenheiro de Software",
    "intership": "Estágio",
    "education": "Formação Acadêmica",
    "htc-ads": "Curso Superior de Tecnologia em Análise e Desenvolvimento de Sistemas",
    "full-time": "Tempo Integral",
    "aug-2020-jul-2023": "Ago 2020 - Jul 2023",
    "brazil": "Brasil",
    "mar-2024-present": "Mar 2024 - Atual",
    "feb-2022-mar-2023": "Fev 2022 - Mar 2023",
    "intern": "Estagiário",
    "technologies": "Tecnologias",
    "languages-a-frameworks": "Linguagens & Frameworks",
    "languages-a-frameworks-desc": "Linguagens e Frameworks que tenho trabalhado recentemente",
    "devops-tools": "Ferramentas DevOps",
    "devops-tools-desc": "Ferramentas de DevOps que utilizo",
    "databases": "Bancos de Dados",
    "databases-desc": "Bancos de dados que já trabalhei",
    "projects": {
        "title": "Projetos",
        "list": {
            "project1": {
                "title": "Binance Trades Bot",
                "description": "Bot de recomendações de compra de criptomoedas. Esse bot coleta dados da API da Binance, salva no banco de dados MongoDB e envia uma mensagem personalizada por IA utilizando a API do Telegram",
                "stack": "Python, Terraform e Telegram API"
            },
            "project2": {
                "title": "GitHub Actions - Workflows",
                "description": "Workflows reutilizáveis do GitHub Actions. Esse projeto agrupa workflows personalizados para Python, Docker, Terraform, AWS Beanstalk, AWS Lambda, entre outros",
                "stack": "CI/CD e GitHub Actions"
            },
            "project3": {
                "title": "FATEC - Graduação",
                "description": "Projetos e laboratórios desenvolvidos durante minha graduação em Análise e Desenvolvimento de Sistemas na FATEC",
                "stack": "Java, Python, C e Terraform"
            },
            "project4": {
                "title": "Beecrowd - Desafios de Código",
                "description": "Resolução de inúmeros desafios de programação do site Beecrowd",
                "stack": "Python, Java, Javascript, C, Kotlin e SQL"
            },
            "project5": {
                "title": "Pagar.me - Desafio",
                "description": "Resolução do desafio de Back-end da Pagar.me de implementar um Payment Service Provider (PSP)",
                "stack": "NodeJS, Express and MongoDB"
            },
            "project6": {
                "title": "Sistema de Controle Financeiro",
                "description": "Sistema para controle de finanças pessoais",
                "stack": "Java, Spring, Angular e Kotlin"
            }
        },
        "card": {
            "tech-stack": "Tecnologias",
            "view-code": "Ver Código",
            "live-preview": "Ver aplicação"
        }
    },
    "contact": "Contato",
    "any-questions": "Deseja falar comigo? Envie um e-mail",
    "or": "ou"
}